{
    "headache": "Common causes include tension, dehydration, or eyestrain. Try rest, hydration, and OTC pain relievers. Seek help if severe or persistent.",
    "migraine": "Consider dark, quiet environment. OTC meds may help. Prescription options available for frequent migraines.",
    "fever": "Normal body temperature is 98.6°F (37°C). Adults: seek care if >103°F (39.4°C) or lasting >3 days.",
    "child fever": "Infants under 3 months with 100.4°F (38°C) need immediate evaluation. Older children: watch for dehydration.",
    "cough": "May indicate cold, flu, or allergies. Honey or cough drops may help. See doctor if lasts >3 weeks or with bloody phlegm.",
    "dry cough": "Often from postnasal drip or irritation. Humidifiers and lozenges may help. Persistent cough needs evaluation.",
    "sore throat": "Usually viral. Gargle warm salt water, use throat lozenges. See doctor if severe pain or lasts >1 week.",
    "strep throat": "Requires antibiotics. Symptoms include fever, white patches on tonsils, and no cough. Needs throat swab test.",
    "runny nose": "Common with colds/allergies. Antihistamines help allergies. Saline spray may relieve congestion.",
    "nasal congestion": "Steam inhalation, decongestants (short-term), or nasal saline rinses may help. Chronic congestion needs evaluation.",
    "sinus pain": "Warm compresses, hydration, and decongestants may help. See doctor if severe pain or lasts >10 days.",
    "ear pain": "Warm compress may help. Children often need evaluation for ear infections. Adults with persistent pain need exam.",
    "toothache": "Rinse with warm salt water. Use OTC pain relievers. See dentist ASAP for persistent pain or swelling.",
    "heartburn": "Avoid spicy/fatty foods. Antacids may help. Frequent heartburn (2+/week) needs medical evaluation.",
    "indigestion": "Eat smaller meals. Avoid late-night eating. Persistent symptoms may indicate GERD or other conditions.",
    "nausea": "Sip clear fluids, try ginger. Seek care if persistent or with severe pain/vomiting.",
    "vomiting": "Stay hydrated with small sips of clear fluids. Seek care if lasts >24h or with signs of dehydration.",
    "diarrhea": "BRAT diet (bananas, rice, applesauce, toast). Stay hydrated. Seek care if bloody or lasts >2 days.",
    "constipation": "Increase fiber/water intake. Mild laxatives may help. Chronic constipation needs evaluation.",
    "stomach pain": "For mild cases, try heat pad and rest. Seek care for severe pain, vomiting, or lasting >24h.",
    "food poisoning": "Rest and hydration are key. Seek care if bloody diarrhea, high fever, or signs of dehydration.",
    "back pain": "Ice/heat therapy, gentle stretches. OTC pain relievers may help. Seek care if radiates down legs or causes weakness.",
    "neck pain": "Gentle stretches, good posture. See doctor if pain radiates to arms or causes numbness/weakness.",
    "muscle pain": "Rest, ice, OTC pain relievers. Seek care if severe or with swelling/discoloration.",
    "joint pain": "RICE method (Rest, Ice, Compression, Elevation). Persistent pain needs evaluation.",
    "knee pain": "Rest, ice, and OTC anti-inflammatories may help. Seek care for swelling, locking, or instability.",
    "ankle pain": "RICE method. Seek care if unable to bear weight or with significant swelling.",
    "wrist pain": "Rest and splinting may help. Repetitive strain may need ergonomic adjustments.",
    "shoulder pain": "Rest and gentle stretches. Seek care if unable to move arm or with severe pain.",
    "arthritis symptoms": "Joint pain/stiffness, especially mornings. Treatment includes meds, exercise, and sometimes surgery.",
    "allergy symptoms": "Sneezing, itchy eyes/nose. Antihistamines and nasal steroids help. See allergist for severe cases.",
    "asthma symptoms": "Wheezing, shortness of breath. Use prescribed inhalers. Seek emergency care for severe attacks.",
    "high blood pressure": "Lifestyle changes (diet/exercise) help. May need medication. Regular monitoring important.",
    "low blood pressure": "Increase fluid/salt intake if approved by doctor. Stand up slowly. Evaluate if causing dizziness/falls.",
    "cholesterol": "Diet low in saturated fats helps. Exercise and medications may be needed for high levels.",
    "diabetes symptoms": "Increased thirst/urination, fatigue. Requires blood testing for diagnosis.",
    "low blood sugar": "Consume 15g fast-acting carbs (juice, glucose tabs). Recheck in 15 minutes.",
    "thyroid problems": "Symptoms vary (weight changes, fatigue). Blood tests needed for diagnosis.",
    "anemia symptoms": "Fatigue, pale skin, shortness of breath. Blood tests determine cause and treatment.",
    "depression symptoms": "Persistent sadness, loss of interest. Counseling and/or medication can help.",
    "anxiety symptoms": "Excessive worry, physical symptoms. Therapy and relaxation techniques help.",
    "insomnia": "Good sleep hygiene helps. Avoid screens before bed. Chronic insomnia may need evaluation.",
    "fatigue": "Ensure adequate sleep, nutrition, hydration. Persistent fatigue needs medical evaluation.",
    "dizziness": "Sit/lie down when dizzy. Hydrate. Seek care if recurrent or with other neurological symptoms.",
    "vertigo": "Often from inner ear issues. Specific maneuvers can help. See doctor for recurrent episodes.",
    "head injury": "Seek immediate care for loss of consciousness, confusion, or worsening symptoms.",
    "sunburn": "Cool compresses, aloe vera, hydration. Seek care for blistering or fever.",
    "rash": "Keep clean/dry. Hydrocortisone cream for itch. Seek care if widespread or with fever.",
    "hives": "Antihistamines help. Seek care if with swelling of face/lips or breathing difficulty.",
    "poison ivy": "Wash area, use calamine lotion. Oral antihistamines help itching. Severe cases may need steroids.",
    "burn treatment": "Cool water (not ice), cover loosely. Seek care for large burns or on face/hands/genitals.",
    "cut treatment": "Clean with water, apply pressure for bleeding. Seek care for deep wounds or signs of infection.",
    "sprain": "RICE method (Rest, Ice, Compression, Elevation). Seek care if unable to bear weight.",
    "strain": "Rest, ice, gentle stretching. OTC pain relievers may help.",
    "pink eye": "Warm compresses help. Viral cases resolve in 1-2 weeks. Bacterial needs antibiotic drops.",
    "stye": "Warm compresses 4x/day. Usually resolves in 1-2 weeks. See doctor if persistent.",
    "vision changes": "Sudden changes need immediate evaluation. Gradual changes need eye exam.",
    "urinary pain": "May indicate UTI. Increased fluids help. See doctor for testing/treatment.",
    "frequent urination": "May indicate UTI, diabetes, or other conditions. Needs evaluation.",
    "menstrual cramps": "Heat, OTC pain relievers, exercise may help. Severe pain needs evaluation.",
    "pregnancy symptoms": "Missed period, nausea, breast changes. Home tests detect hCG hormone.",
    "morning sickness": "Small frequent meals, ginger may help. Severe cases need medical attention.",
    "breast pain": "Often hormonal. See doctor for lumps, skin changes, or persistent pain.",
    "erectile dysfunction": "May indicate vascular issues. Lifestyle changes and medications can help.",
    "STD symptoms": "Vary by infection. Testing needed for diagnosis. Many are treatable.",
    "cold sores": "Antiviral creams may help. Avoid touching/spreading. Usually resolve in 7-10 days.",
    "athlete's foot": "Antifungal creams/sprays. Keep feet dry. May take 4 weeks to clear.",
    "ringworm": "Antifungal creams. Keep area dry. See doctor if widespread or not improving.",
    "flu symptoms": "Fever, body aches, fatigue. Rest and fluids are key. Antivirals may help if started early.",
    "cold symptoms": "Runny nose, sore throat. Rest and fluids help. Usually resolves in 7-10 days.",
    "COVID symptoms": "Fever, cough, loss of taste/smell. Testing needed for diagnosis. Isolate if positive.",
    "vaccine side effects": "Mild fever, soreness common. Serious reactions rare. Report severe symptoms.",
    "smoking cessation": "Nicotine replacement, medications, counseling can help. Quitting has immediate benefits.",
    "weight loss": "Healthy diet and exercise. Unexplained weight loss needs medical evaluation.",
    "healthy diet": "Focus on fruits, vegetables, whole grains, lean proteins. Limit processed foods.",
    "exercise benefits": "30 minutes daily improves cardiovascular health, mood, and longevity.",
    "stress management": "Exercise, meditation, adequate sleep help. Chronic stress needs attention.",
    "high cholesterol diet": "Limit saturated/trans fats. Increase fiber. Fish and nuts may help.",
    "heart healthy diet": "Focus on vegetables, whole grains, lean proteins. Limit salt and saturated fats.",
    "diabetic diet": "Balance carbohydrates. Focus on fiber-rich foods. Regular meal timing helps.",
    "blood pressure diet": "DASH diet helps: fruits, vegetables, low-fat dairy, reduced sodium.",
    "prenatal vitamins": "Contain folic acid, iron, calcium. Important before/during pregnancy.",
    "vitamin D": "Sunlight exposure helps. Supplements may be needed, especially in winter.",
    "probiotics": "May help gut health. Found in yogurt, supplements. Effects vary by strain.",
    "hydration": "Aim for 8 glasses water daily. More needed with exercise/heat.",
    "sleep hygiene": "Regular schedule, dark/quiet room, limit screens before bed.",
    "sun protection": "SPF 30+, reapply every 2 hours. Seek shade 10am-4pm.",
    "tick bite": "Remove with tweezers, clean area. Watch for rash/fever (Lyme disease signs).",
    "animal bite": "Clean thoroughly. Seek care for deep wounds or unknown animal vaccination status.",
    "first aid kit": "Should include bandages, gauze, antiseptic, gloves, pain relievers, etc."
}